export type tGroup = {
    "id": number,
    "Группа": string | number,
    "Минимальний рейтинг": number ,
    "Максимальний рейтинг": number ,
    "Средний рейтинг": number,
}[];


export const groupedByPlatform: tGroup = [
    {
        "id": 0,
        "Группа": "Windows",
        "Минимальний рейтинг": 7.5,
        "Максимальний рейтинг": 9.9,
        "Средний рейтинг": 8.83
    },
    {
        "id": 1,
        "Группа": "PS4",
        "Минимальний рейтинг": 8,
        "Максимальний рейтинг": 9.8,
        "Средний рейтинг": 9.09
    },
    {
        "id": 2,
        "Группа": "PS5",
        "Минимальний рейтинг": 7.8,
        "Максимальний рейтинг": 9.6,
        "Средний рейтинг": 8.93
    },
    {
        "id": 3,
        "Группа": "Xbox One",
        "Минимальний рейтинг": 8,
        "Максимальний рейтинг": 9.8,
        "Средний рейтинг": 9.02
    },
    {
        "id": 4,
        "Группа": "Xbox Series X",
        "Минимальний рейтинг": 7.8,
        "Максимальний рейтинг": 9.6,
        "Средний рейтинг": 8.84
    },
    {
        "id": 5,
        "Группа": "Switch",
        "Минимальний рейтинг": 8,
        "Максимальний рейтинг": 9.7,
        "Средний рейтинг": 9.18
    },
    {
        "id": 6,
        "Группа": "Linux",
        "Минимальний рейтинг": 9,
        "Максимальний рейтинг": 9.2,
        "Средний рейтинг": 9.1
    },
    {
        "id": 7,
        "Группа": "Mac",
        "Минимальний рейтинг": 8.9,
        "Максимальний рейтинг": 9.2,
        "Средний рейтинг": 9.03
    },
    {
        "id": 8,
        "Группа": "Mobile",
        "Минимальний рейтинг": 8.7,
        "Максимальний рейтинг": 9.2,
        "Средний рейтинг": 8.97
    }
];

export const groupedByGenre: tGroup = [
    {
        "id": 0,
        "Группа": "РПГ",
        "Минимальний рейтинг": 7.5,
        "Максимальний рейтинг": 9.9,
        "Средний рейтинг": 8.94
    },
    {
        "id": 1,
        "Группа": "Экшен-приключения",
        "Минимальний рейтинг": 8.5,
        "Максимальний рейтинг": 9.8,
        "Средний рейтинг": 9.3
    },
    {
        "id": 2,
        "Группа": "Экшен-РПГ",
        "Минимальний рейтинг": 8.5,
        "Максимальний рейтинг": 9.5,
        "Средний рейтинг": 9.13
    },
    {
        "id": 3,
        "Группа": "Шутер",
        "Минимальний рейтинг": 7.8,
        "Максимальний рейтинг": 9,
        "Средний рейтинг": 8.56
    },
    {
        "id": 4,
        "Группа": "МОБА",
        "Минимальний рейтинг": 8.9,
        "Максимальний рейтинг": 9.2,
        "Средний рейтинг": 9.05
    },
    {
        "id": 5,
        "Группа": "Выживание",
        "Минимальний рейтинг": 8.5,
        "Максимальний рейтинг": 9.1,
        "Средний рейтинг": 8.87
    },
    {
        "id": 6,
        "Группа": "Песочница",
        "Минимальний рейтинг": 9.5,
        "Максимальний рейтинг": 9.5,
        "Средний рейтинг": 9.5
    },
    {
        "id": 7,
        "Группа": "Королевская битва",
        "Минимальний рейтинг": 8.5,
        "Максимальний рейтинг": 8.7,
        "Средний рейтинг": 8.6
    },
    {
        "id": 8,
        "Группа": "Рогалик",
        "Минимальний рейтинг": 9,
        "Максимальний рейтинг": 9.4,
        "Средний рейтинг": 9.2
    },
    {
        "id": 9,
        "Группа": "Симулятор",
        "Минимальний рейтинг": 8.9,
        "Максимальний рейтинг": 9.3,
        "Средний рейтинг": 9.1
    },
    {
        "id": 10,
        "Группа": "Приключения",
        "Минимальний рейтинг": 8.3,
        "Максимальний рейтинг": 9.2,
        "Средний рейтинг": 8.75
    },
    {
        "id": 11,
        "Группа": "Партийная",
        "Минимальний рейтинг": 8,
        "Максимальний рейтинг": 8,
        "Средний рейтинг": 8
    },
    {
        "id": 12,
        "Группа": "Хоррор на выживание",
        "Минимальний рейтинг": 9.2,
        "Максимальний рейтинг": 9.2,
        "Средний рейтинг": 9.2
    },
    {
        "id": 13,
        "Группа": "Платформер",
        "Минимальний рейтинг": 9.6,
        "Максимальний рейтинг": 9.6,
        "Средний рейтинг": 9.6
    },
    {
        "id": 14,
        "Группа": "Спорт",
        "Минимальний рейтинг": 8.8,
        "Максимальний рейтинг": 8.8,
        "Средний рейтинг": 8.8
    }
];

export const groupedByYear: tGroup = [
    {
        "id": 0,
        "Группа": 2009,
        "Минимальний рейтинг": 8.9,
        "Максимальний рейтинг": 8.9,
        "Средний рейтинг": 8.9
    },
    {
        "id": 1,
        "Группа": 2011,
        "Минимальний рейтинг": 9.2,
        "Максимальний рейтинг": 9.5,
        "Средний рейтинг": 9.37
    },
    {
        "id": 2,
        "Группа": 2013,
        "Минимальний рейтинг": 9.2,
        "Максимальний рейтинг": 9.6,
        "Средний рейтинг": 9.4
    },
    {
        "id": 3,
        "Группа": 2015,
        "Минимальний рейтинг": 8.7,
        "Максимальний рейтинг": 9.7,
        "Средний рейтинг": 9.07
    },
    {
        "id": 4,
        "Группа": 2016,
        "Минимальний рейтинг": 8.3,
        "Максимальний рейтинг": 9.3,
        "Средний рейтинг": 8.8
    },
    {
        "id": 5,
        "Группа": 2017,
        "Минимальний рейтинг": 8.5,
        "Максимальний рейтинг": 9.7,
        "Средний рейтинг": 9.23
    },
    {
        "id": 6,
        "Группа": 2018,
        "Минимальний рейтинг": 8,
        "Максимальний рейтинг": 9.8,
        "Средний рейтинг": 8.95
    },
    {
        "id": 7,
        "Группа": 2019,
        "Минимальний рейтинг": 8.7,
        "Максимальний рейтинг": 9.6,
        "Средний рейтинг": 9.13
    },
    {
        "id": 8,
        "Группа": 2020,
        "Минимальний рейтинг": 7.5,
        "Максимальний рейтинг": 9.4,
        "Средний рейтинг": 8.76
    },
    {
        "id": 9,
        "Группа": 2021,
        "Минимальний рейтинг": 8.2,
        "Максимальний рейтинг": 9,
        "Средний рейтинг": 8.6
    },
    {
        "id": 10,
        "Группа": 2022,
        "Минимальний рейтинг": 7.8,
        "Максимальний рейтинг": 9.5,
        "Средний рейтинг": 9.05
    },
    {
        "id": 11,
        "Группа": 2023,
        "Минимальний рейтинг": 7.8,
        "Максимальний рейтинг": 9.9,
        "Средний рейтинг": 8.69
    },
    {
        "id": 12,
        "Группа": 2024,
        "Минимальний рейтинг": 8.5,
        "Максимальний рейтинг": 8.7,
        "Средний рейтинг": 8.6
    }
];