import Image1 from "./images/1.jpg"
import Image2 from "./images/2.jpg"
import Image3 from "./images/3.jpg"
import Image4 from "./images/4.jpg"
import Image5 from "./images/5.jpg"
import Image6 from "./images/6.jpeg"
import Image7 from "./images/7.jpg"
import Image8 from "./images/8.jpg"


export const persons = [
    {
        img: Image1,
        title: "Хидэо Кодзима",
        place: "Токио, Япония",
        description: [
            "Хидэо Кодзима — японский геймдизайнер, родился 24 августа 1963 года в Токио. На протяжении многих лет работал в компании Konami Digital Entertainment, в том числе как руководитель внутренней студии Kojima Productions, и некоторое время был вице-президентом Konami. После разрыва с Konami в 2015 году Кодзима воссоздал и возглавил Kojima Productions уже как независимую студию. Наиболее известен как создатель серии игр Metal Gear. Разработанные под его руководством игры этой серии выходили на протяжении более чем четверти века, оказав немалое влияние на жанр стелс-игр и индустрию компьютерных игр в целом.",
            "Кодзима наиболее известен как создатель серии игр Metal Gear — разработанные под его руководством игры этой серии выходили на протяжении более чем четверти века, оказав немалое влияние на жанр стелс-игр и индустрию компьютерных игр в целом. Помимо Metal Gear, Кодзима также разработал приключенческие игры Snatcher и Policenauts и также выступал продюсером других игр и серий, в том числе Zone of the Enders, Boktai и Castlevania: Lords of Shadow. Death Stranding стала первой игрой Кодзимы, разработанной вне Konami."
        ]
    },
    {
        img: Image2,
        title: "Тодд Говард",
        place: "США",
        description: [
            "Тодд Эндрю Говард (род. 25 апреля 1971 года) — американский геймдизайнер, геймдиректор и продюсер. В настоящее время является исполнительным продюсером компании Bethesda Game Studios, в которой руководит разработкой компьютерных игр из серий The Elder Scrolls и Fallout.",
            "Наиболее известен по работе над сериями ролевых игр (RPG) «The Elder Scrolls» и «Fallout». Для видеоигр Говарда характерен акцент на создании больших открытых миров с многочисленными точками интереса, которые игрок может свободно исследовать. Журнал GamePro назвал его одним из 20 самых влиятельных людей в игровой индустрии за последние 20 лет, а IGN — одним из лучших разработчиков игр за всё время."
        ]
    },
    {
        img: Image3,
        title: "Джон Кармак",
        place: "США",
        description: [
            "Джон Д. Кармак II — американский разработчик компьютерных игр. Также инженер в областях информатики, аэрокосмической техники и виртуальной реальности, предприниматель, соучредитель и совладелец компаний id Software и Armadillo Aerospace.",
            "В 1991 году Кармак стал одним из основателей компании id Software, которая прославилась разработкой основополагающих игр в жанре FPS — Wolfenstein 3D, Doom, Quake, — ведущим программистом которых был Кармак. Одним из первых успешных проектов Кармака стала серия игр 1990 года Commander Keen — платформер для MS-DOS, где программист и его команда реализовали плавную графику типа сайд-скроллер, что было инновацией в те времена и повлияло на все последующие игры такого плана."
        ]
    },
    {
        img: Image4,
        title: "Гейб Логан Ньюэлл",
        place: "США",
        description: [
            "Гейб Логан Ньюэлл (Gabe Logan Newell) – известный программист и основатель компании Valve, а также разработчик игр и гейм дизайнер. Гейб родился в США в Сиэтле, в благополучной семье. В списке Forbes Логан занимал 854 место в 2012 году. Послужило этому партнёрство со многими крупными разработчиками и издателями игр, а также продвижение сервиса Steam, ведь сколько игр можно найти на этой плащадке. На данный момент, у данной платформы нет достойных конкурентов, и она занимает первую строчку с большим отрывом.",
            "В 1980 году Гейб поступает в престижное учебное заведение – Гарвардский университет. Однако, он не доучивается там, ради работы в компании Microsoft. Примечательно то, что в те времена эта компания не была еще столь известной, поэтому будущий миллиардер очень рисковал, бросая учебу. Подбил Логана на такой амбициозный шаг – Стив Балмер, который в те времена возглавлял отдел продаж корпорации. Как вспоминает сам Гейб, работа в Майкрософт дала ему больше знаний за 3 месяца, чем учеба за 3 года."
        ]
    },
    {
        img: Image5,
        title: "Сидни Мейер",
        place: "Онтарио, Канада",
        description: [
            "Сидни К. \"Сид\" Мейер (англ. Sidney K. \"Sid\" Meier) — американский разработчик компьютерных игр. Выпускник Университета штата Мичиган. В 2002 году его имя вписали в Зал Славы Компьютерного музея Америки (Computer Museum of America's Hall of Fame).",
            "С 1982 года в основанной им компании MicroProse Software, Inc. разрабатываются игры для первых персональныхкомпьютеров Commodore 64, Apple II и Atari 800. В 1993 году крупная вертикально интегрированная компания Spectrum HoloByte, Inc. предпринимает усилия по поглощению MicroProze. По завершении юридичских процедур к 1994 году у Мейера и нового генерального директора фирмы Луи Гилмана (Gilman Louie) наметились некоторые расхождения в вопросах относительно того, куда, как и зачем развивать совместный игровой бизнес. Общая ситуация характеризуется тем, что так много сделавший для игры Railroad Tycoon Брюс Шелли бросает Microproze в 1995 для основания собственной студии Ensemble (совместно с братьями Тони и Риком Гудманами)."
        ]
    },
    {
        img: Image6,
        title: "Кен Левин",
        place: "Нью-Йорк, США",
        description: [
            "Кен Левин (англ. Ken Levine, родился 1 сентября 1966 года) — американский геймдизайнер, творческий директор и один из основателей компании Irrational Games. Левин известен прежде всего как создатель компьютерных игр BioShock, Thief: The Dark Project и System Shock 2. Левин был назван одним из «Лучших рассказчиков десятилетия» журналом Game Informer и в 2007 году стал «Человеком года» по версии портала 1UP. Он был удостоен награды Golden Joystick Awards за многолетний вклад в игровую индустрию, в том числе за игры System Shock 2 и BioShock.",
            "Левин родился в еврейской семье в городе Флашинг, штат Нью-Йорк. Он считает себя атеистом. Левин изучал драматическое искусство в колледже Вассар в Поукипзи, позже переехал в Лос-Анджелес в попытке найти работу в кинематографе. В этот период он написал два сценария. В 1995 году Левин был принят на должность геймдизайнера в студию Looking Glass Studios, ответив на их объявление о поиске сотрудников в журнале Next Generation Magazine. В Looking Glass Studios Левин работал вместе с дизайнером Дагом Черчем над разрабатываемым сценарием и дизайном компьютерной игры Thief: The Dark Project."
        ]
    },
    {
        img: Image7,
        title: "Сэм Лейк",
        place: "Хельсинки, Финляндия",
        description: [
            "Са́ми А́нтеро Я́рви (фин. Sami Antero Järvi; род. 28 марта 1970), более известный под псевдонимом Сэм Лейк (англ. Sam Lake) — финский сценарист компьютерных игр, работавший над рядом игр студии Remedy Entertainment. Петри Ярвилехто, друг Сэма Лейка и основатель Remedy, попросил его поработать над сценарием игры Death Rally. В дальнейшем Сэм Лейк работал над сценариями и к другим играм Remedy — Max Payne, Max Payne 2: The Fall of Max Payne, Alan Wake, Quantum Break, Control и Alan Wake 2. Сэм также пробовал себя в качестве детского писателя — из-под его пера в свет вышла книга «Милла Марбл и тайна пропавшей бабушки». Внешность героя Макса Пэйна в первой игре одноимённой серии смоделирована по образу и подобию Лейка.",
            "Лейк не только написал сценарий для Max Payne, но и помогал в дизайне уровней, и дал внешность главному герою игры. Сэм Лейк также играл Макса и в катсценах, стилизованных под графические новеллы, так как бюджет не позволял нанять профессиональных актёров. Как результат, Лейк и сотрудники Remedy сами сыграли всех персонажей игры. Сэм Лейк принял участие и в создании экранизации игры 2008 года, однако, как заявлял годами позже, студия практически не участвовала в создании фильма, а сам он чувствовал себя «отстранённым» от него и процесса его создания."
        ]
    },
    {
        img: Image8,
        title: "Сигэру Миямото",
        place: "Киото, Япония",
        description: [
            "Сигэру Миямото (яп. 宮本 茂 Миямото Сигэру, род. 16 ноября 1952) — японский геймдизайнер, создавший такие серии видеоигр, как Mario, Donkey Kong, The Legend of Zelda, Star Fox, Nintendogs, Wave Race и Pikmin для игровых консолей Nintendo. Его игры отличаются совершенствующимся управлением и неповторимыми мирами, в которых игроку приходится искать множество секретов и открывать новые локации. ",
            "В настоящее время занимает пост директора и генерального менеджера Nintendo EAD — корпоративного сектора Nintendo of Japan. В 1998 году Миямото стал первым человеком в Зале Славы Академии интерактивных искусств и наук. Имя Миямото помещено в Зал славы компьютерных игр[англ.]. В 1997 году Computer Gaming World поставил Сигэру Миямото на восьмое место в списке самых влиятельных людей в игровой индустрии за его вклад в игровой дизайн."
        ]
    },

];